{
    "yoga": [
        {
            "mood": "all",
            "name": "Mountain Pose (Tadasana)",
            "description": "\"In mountain pose there is a lot going on, even though it may look like just standing. The heels root down, the muscles of the legs are engaged, the bones are stacked with the shoulders directly over the hips, the shoulder blades slide down the back, and the crown of the head rises. Don't forget to breathe.\"",
            "imageUrl": "https://www.verywellfit.com/thmb/oyMr2bOKVVpvR0no1NTGFLP1aJ0=/700x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-01-3567193-MoutainPose04-099-598b64d49abed50010adff46.jpg"
        },
        {
            "mood": "all",
            "name": "Raised Arms Pose (Urdhva Hastansana) ",
            "description": " Inhale and bring your arms up and over your head. Raised arms pose is your basic morning stretch, but focus on keeping the good alignment you established in mountain pose.\n\nStay grounded in the heels and keep your shoulders moving away from your ears at the same time that you reach up through your fingertips. Your gaze can come up to the hands, which can be shoulder's width apart or palms touching. ",
            "imageUrl": "https://www.verywellfit.com/thmb/sPzoqVXfZ1cXZZidc-69x2EXMgE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-3567193-RaisedArmPose-099-598b6627d088c00011cddc24.gif"
        },
        {
            "mood": "all",
            "name": "Standing Forward Bend (Uttanasana) ",
            "description": "Exhale and fold over your legs into a forward bend. If the hamstrings feel a little tight at first, bend the knees so that you can release your spine. Let the head hang heavy. Keep the legs gently bent with feet hip-width apart for better stability (you can straighten the legs, but it is not necessary). You can clasp opposite elbows with opposite hands while swaying gently side to side. ",
            "imageUrl": "https://www.verywellfit.com/thmb/8J82kznb3px8-F1YJz_eH3W-SQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-03-3567193-ForwardBend01-110-598b6652af5d3a0011ccd349.gif"
        },
        {
            "mood": "all",
            "name": "Garland Pose (Malasana) ",
            "description": " Move your feet out to the edges of your mat and bend your knees, coming into a squat. The toes may turn out if necessary. If your heels do not reach the floor, you can sit on two stacked blocks. This modification makes the pose more accessible for many people.\n\nThis is a position that is quite natural for children, but we lose the knack for it as adults. It's great for the hips and to counteract the effects of too much sitting in chairs and riding in cars. It's also a very useful pose if you like to garden. ",
            "imageUrl": "https://www.verywellfit.com/thmb/IOdK1rjp4tATDWUnAFkXmpz4Q0A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-4-3567193-GarlandPose02-661-598b666103f4020010b46e15.gif"
        },
        {
            "mood": "all",
            "name": "Lunge",
            "description": " From malasana, come back into a forward fold with legs gently bent and feet underneath your hips. When you are ready, step your left leg to the back of your mat and bend your right knee for a deep lunge. Try to bring your bent knee directly over your ankle so your right thigh is parallel to the floor. Feel free to place hands on blocks to bring the floor to you.\n\nKeep the left leg straight and strong with your heel reaching back. If this is too intense, you can drop your left knee to the mat instead. Stay five breaths before returning the left foot to the front of your mat next to the right one. Then repeat the lunge with the left foot forward and the right leg back. ",
            "imageUrl": "https://www.verywellfit.com/thmb/o15_2tGWE_U73sltTHHBIYa_wpw=/700x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-5-3567193-LungePose01-664-598b6676b501e80012e551b9.gif"
        }
    ],
    "Breathing Exercise": [
        {
            "mood": "all",
            "name": "Nadi Shodhana or Alternate Nostril Breathing",
            "description": "Inhale deeply through your left nostril while holding your right nostril closed with your right thumb. At its culmination, switch nostrils by closing off your left nostril and continuing to exhale smoothly through your right nostril. After exhaling fully, proceed to inhale through the right nostril, again closing it off at the peak of your inhalation. Lift your finger off the left nostril and exhale fully. Continue alternating your breathing through each nostril and practice for 3 to 5 minutes. Ensure that your breathing is effortless, and your mind gently focusing on the inflow and outflow of breath.",
            "imageUrl": "https://images.pexels.com/photos/4498220/pexels-photo-4498220.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        },
        {
            "mood": "all",
            "name": "Shiitali Kumbhaka or the cooling breath",
            "description": "Fold your tongue lengthwise and inhale deeply through the fold. Close your mouth, hold the breath on a count of eight and then exhale through the nose. Continue for a eight breaths, sustain for a maximum of eight minutes.",
            "imageUrl": "https://images.pexels.com/photos/3059892/pexels-photo-3059892.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        },
        {
            "mood": "all",
            "name": "Shavasana (Corpse Pose)",
            "description": "Lie down on your back and close your eyes. Relax your body and mind. and think happy peaceful thoughts. Take your time while you do this. Breathe normally and do not hold your breath. After some time, stand up.",
            "imageUrl": "https://images.pexels.com/photos/3822647/pexels-photo-3822647.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        }
    ],
    "General": [
        {
            "mood": "happy",
            "name": " Listen to some happy music",
            "description": "Putting on music by your favorite artist, or even just searching “happy playlist” on Spotify will be sure to help improve your mood! Trying to focus on the good music can definitely help improve your mind set!",
            "imageUrl": "https://images.pexels.com/photos/4498195/pexels-photo-4498195.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "happy",
            "name": "Write down what you’re grateful for",
            "description": "When we’re in bad moods, we might be dwelling on the not-so-good stuff happening around us. However, choosing to change your mindset and instead focus on all that is good around you can help you become more grounded and boost your mood in no time! So grab that journal, and start jotting!",
            "imageUrl": "https://images.pexels.com/photos/636243/pexels-photo-636243.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "sad",
            "name": "Pet a dog",
            "description": "Therapy dogs have become a common method for improving the state of your emotions. Dogs provide emotional support by providing companionship to individuals. Simply petting a dog every day can improve one's mental health.",
            "imageUrl": "https://images.pexels.com/photos/1389994/pexels-photo-1389994.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "all",
            "name": "Perform a random act of kindness",
            "description": "Helping others volunteering or simply doing one random act of kindness can improve self-esteem. Self-esteem improves mental wellness in a variety of ways including a self-empowering sense of social connectivity. According to Harvard Health volunteerism contributes to lessening loneliness and depression.",
            "imageUrl": "https://images.pexels.com/photos/3972441/pexels-photo-3972441.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "all",
            "name": "Get plenty of sleep",
            "description": "Adults should get as close to 8 hours of sleep per night as they can. Although every individual's body differs sleep is essential for learning and improving daily productivity.",
            "imageUrl": "https://images.pexels.com/photos/1560424/pexels-photo-1560424.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        },
        {
            "mood": "all",
            "name": "Go outside and soak up the sun",
            "description": "Getting outside can improve your mood by helping you soak up some vitamin D, which has tons of benefits. Try to do a fun activity outside like playing Frisbee, going for a hike, or even just sunbathing for a bit (but then, with summer coming to an end, you might want to save that last one for next year).",
            "imageUrl": "https://images.pexels.com/photos/943935/pexels-photo-943935.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "sad",
            "name": "Spend some quality time with a close friend (or friends)",
            "description": "Friends are a great source of support and comfort in our lives. If you’re feeling down, hanging out with someone close to you can be a way to feel joy and comfort. Don’t be afraid to call your friend, even at the times – if not especially at the times – that you’re not feeling your best. After all, that’s what friends are there for!",
            "imageUrl": "https://images.pexels.com/photos/6147077/pexels-photo-6147077.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "sad",
            "name": "Watch a funny show",
            "description": "There’s nothing wrong with putting on your favorite funny show to get a good laugh. As they say “laughter is the best medicine”. Some quality laughter-inducing shows include Friends, New Girl, and The Office. Don’t be afraid to laugh out loud.",
            "imageUrl": "https://images.pexels.com/photos/4307935/pexels-photo-4307935.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "all",
            "name": "Paint Something",
            "description": "Grab some finger paint or watercolors that you have on hand and just have fun painting something new. You don’t have to be good at it to have fun.",
            "imageUrl": "https://images.pexels.com/photos/5569045/pexels-photo-5569045.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        },
        {
            "mood": "happy",
            "name": "Cooking",
            "description": "cooking or baking has become a common cure for stress or feeling down !Go and choose your favorite Dish,cook it and enjoy!",
            "imageUrl": "https://images.pexels.com/photos/4686816/pexels-photo-4686816.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        },
        {
            "mood": "all",
            "name": "Meditate",
            "description": "Take some time to rest, relax, and center your mind to find happiness.",
            "imageUrl": "https://images.pexels.com/photos/372281/pexels-photo-372281.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        },
        {
            "mood": "ok",
            "name": "Play A Board Game",
            "description": "Seriously, Monopoly never gets old! Scrabble and Cranium are really fun too.",
            "imageUrl": "https://images.pexels.com/photos/1634213/pexels-photo-1634213.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
        },
        {
            "mood": "all",
            "name": "Connect with Nature",
            "description": "",
            "imageUrl": "https://images.pexels.com/photos/2492097/pexels-photo-2492097.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500"
        }
    ],
    "Exercise": [
        {
            "mood": "ok",
            "name": "Use a stress ball or some other stress reliever",
            "description": "The way we handle stress directly affects our health. A common method to deal with stress is a stress ball. Just squeeze the frustrations away!",
            "imageUrl": "https://images.pexels.com/photos/1579371/pexels-photo-1579371.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260"
        }
    ]
}